# 列表基本操作
# a = [1,2,3,4,5]
# print(a[::2])   # [1, 3, 5]
# print(a[-2:])   # [4, 5]
# =======================================================
# 合并两个列表，去除重复元素，并且保持元素的排列顺序不变
# a = [1,2,3,8,10,52]
# b = [1,5,10,65,89,102]
# print(a[-1])
#
# c=a[::]
# for item in b:
#     if item not in a:
#         c.append(item)
#
# print(c)
# print(list(c))
# =======================================================
# 统计单词出现次数
# msg = 'This is my desck, it is not yours!'
# msg = msg.split(' ')
# count = {}
# for word in msg:
#     count.setdefault(word, 0)
#     count[word] = count[word] + 1
#
# print(count)
# =======================================================
# 打印如下图形
# 1
# 1 2 1
# 1 2 3 2 1
# 1 2 3 4 3 2 1
# 1 2 3 4 5 4 3 2 1
# for i in range(1,6):
#     for j in range(1,i+1):
#         print(j, end=' ')
#     for m in range(i-1, 0, -1):
#         print(m, end= ' ')
#     print('')

# =======================================================
# 打印乘法口诀表：
# 1*1=1
# 1*2=2 2*2=4
# 1*3=3 2*3=6 3*3=9
# 1*4=4 2*4=8 3*4=12 4*4=16
# 1*5=5 2*5=10 3*5=15 4*5=20 5*5=25
# 1*6=6 2*6=12 3*6=18 4*6=24 5*6=30 6*6=36
# 1*7=7 2*7=14 3*7=21 4*7=28 5*7=35 6*7=42 7*7=49
# 1*8=8 2*8=16 3*8=24 4*8=32 5*8=40 6*8=48 7*8=56 8*8=64
# 1*9=9 2*9=18 3*9=27 4*9=36 5*9=45 6*9=54 7*9=63 8*9=72 9*9=81
# for i in range(1,10):
#     for j in range(1,i+1):
#         print(str(j) + '*' + str(i) + '=' + str(i*j), end=' ')
#     print('')
